notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>notes</title>
<link rel="stylesheet" href="revealjs/css/reveal.min.css"/>
<link rel="stylesheet" href="revealjs/css/theme/default.css" id="theme"/>

<link rel="stylesheet" href="revealjs/css/print/pdf.css" type="text/css" media="print"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>notes</h1>
<h2></h2>
<h2><a href="mailto:kotfic@carasgaladon">kotfic@carasgaladon</a></h2>
<h2></h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">Provisions, Quid pro quos</a>
</li>
<li>
<a href="#sec-2">Reproducible research as bridge</a>
</li>
<li>
<a href="#sec-3">Tools and Metrics</a>
</li>
<li>
<a href="#sec-4">Tasks</a>
<ul>
<li>
<a href="#sec-4-1">more information about Sweave</a>
</li>
<li>
<a href="#sec-4-2">get more info about SPARQL</a>
</li>
<li>
<a href="#sec-4-3">find quote about the paper being an advertisement for the reserch</a>
</li>
<li>
<a href="#sec-4-4">Does Authorea fit in here?</a>
</li>
</ul>
</section>

<section>
<section id="sec-1" >

<h2><span class="section-number-2">1</span> Provisions, Quid pro quos</h2>
<ul class="org-ul">
<li>Qualitative research,  research that lends itself to statistical analysis,  or requires any kind of data transformation before being analyzed.
</li>
</ul>
</section>

</section>
<section>
<section id="sec-2" >

<h2><span class="section-number-2">2</span> Reproducible research as bridge</h2>
<ul class="org-ul">
<li>Open Data provides direct access to data sources that have been created by all types of institutions (Gov, academic, private sector)
<ul class="org-ul">
<li>Published in many different ways, Raw data files,  API, SPARQL, sometimes this data is useful,  sometimes it is garbage
</li>
</ul>
</li>
<li>Open Access "advertises" the research,  but isn't the research itself.
<ul class="org-ul">
<li>Will need to do obligatory introduction to reproducible as foundation of modern science
</li>
<li>Open Access is absolutely vital - it raises the visibility of a paper, research, and improves over all impact [citation?] <sup><a id="fnr.1" name="fnr.1" class="footref" href="#fn.1">1</a></sup> 
</li>
</ul>
</li>
<li>The ACTUAL research is the transformed data, and the analysis - sometimes this means data cleanup,  sometimes this means large scale data transformation pipelines like in NLP and machine learning
<ul class="org-ul">
<li>reproducible research is the bridge between open data and open access it takes open data as an input, and produces papers as an output
</li>
<li>shifting from a "publication as research" model the [data + transformation code + analysis + interpretation] as the research changes the meaning of open access to research
</li>
<li>This begs an important question - how do we publish this kind of "document"
</li>
<li>Not restrained by old journal model - can skip growing pains of online journal model (analogy of 1960's movies that were just filmed theater shows?)
</li>
<li>Some have already discussed blogs, social networking etc as possible outcomes,  but metrics in this environment are still emerging
</li>
<li>Metrics in the field of software engineering are pretty good though,
</li>
<li>In broad strokes,  software engineers produce code and documentation,   researchers produce documentation (in the form of publications)  and code. 
<ul class="org-ul">
<li>software engineers even have a counterpart to Reproducible research - literate programming.
</li>
</ul>
</li>
<li>Key component of reproducible is access to the tools that produced to code and documentation - tie in open source
</li>
</ul>
</li>
</ul>
</section>

</section>
<section>
<section id="sec-3" >

<h2><span class="section-number-2">3</span> Tools and Metrics</h2>
<ul class="org-ul">
<li>Github and github style metrics
</li>
<li>Sweave
</li>
<li>Emacs w/org-mode and org-babel
</li>
<li>Things out there that are interesting,  but don't quite get the job done
<ul class="org-ul">
<li>Google Docs (highly collaborate, no version control,  no code integration) 
</li>
<li>Authorea - (highly collaborative,  focus on academic's needs) 
</li>
<li>runmycode.org ( code but no direct integration with "documentation", collaborative but not quite like github)
</li>
</ul>
</li>
<li>requirements for the ideal process
<ul class="org-ul">
<li>Open source tools (so barrier to access to those tools is only technical)
</li>
<li>allows collaboration across researchers
</li>
<li>embeds research (ie. code) directly into the documentation. 
</li>
<li>version control (for archiving!) 
</li>
</ul>
</li>
</ul>
</section>
</section>
<section>
<section id="sec-4" >

<h2><span class="section-number-2">4</span> Tasks</h2>
</section>
<section id="sec-4-1" >

<h3><span class="section-number-3">4.1</span> <span class="todo TODO">TODO</span> more information about Sweave</h3>
</section>
<section id="sec-4-2" >

<h3><span class="section-number-3">4.2</span> <span class="todo TODO">TODO</span> get more info about SPARQL</h3>
</section>
<section id="sec-4-3" >

<h3><span class="section-number-3">4.3</span> <span class="todo TODO">TODO</span> find quote about the paper being an advertisement for the reserch</h3>
</section>
<section id="sec-4-4" >

<h3><span class="section-number-3">4.4</span> <span class="todo TODO">TODO</span> Does Authorea fit in here?</h3>
<p>
<a href="https://www.authorea.com/">https://www.authorea.com/</a>
</p>
</section>
</section>
</div>
</div>
<script src="revealjs/lib/js/head.min.js"></script>
<script src="revealjs/js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: true,
        			rollingLinks: true,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			 // slide minimum scaling factor
        			 // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'default', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: 'revealjs/lib/js/classList.js', condition: function() { return !document.body.classList; } },
        				{ src: 'revealjs/plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: 'revealjs/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
        				{ src: 'revealjs/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
        				{ src: 'revealjs/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
        				{ src: 'revealjs/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'revealjs/plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: 'revealjs/plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
        			]
        		});
</script>
</body>
</html>
